БИТУправление_медицинским_центром_демо/src/ChartsOfCharacteristicTypes/ПараметрыHTML/ПараметрыHTML.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ПараметрыHTML</name>
  <type>
    <types>CatalogRef.СправочникМеждународныхНепатентованныхНаименований</types>
    <types>CatalogRef.Номенклатура</types>
    <types>CatalogRef.СтрокиЭМКНеограниченнойДлины</types>
    <types>CatalogRef.Подразделения</types>
    <types>CatalogRef.РеестрМедицинскихОрганизаций</types>
    <types>DocumentRef.Прием</types>
    <types>CatalogRef.ИнструментальныеИсследования</types>
    <types>CatalogRef.ДействующиеВеществаЛекарственныхПрепаратов</types>
    <types>CatalogRef.НоменклатураМедицинскихУслуг</types>
    <types>Boolean</types>
    <types>CatalogRef.СоглашенияСтрахования</types>
    <types>CatalogRef.Клиенты</types>
    <types>CatalogRef.Филиалы</types>
    <types>DocumentRef.ДоговорСКлиентом</types>
    <types>CatalogRef.СтраховыеПолисы</types>
    <types>String</types>
    <types>CatalogRef.Диагнозы</types>
    <types>CatalogRef.Сотрудники</types>
    <types>Date</types>
    <types>CatalogRef.КатегорииВыработки</types>
    <types>CatalogRef.ДополнительныеЗначенияХарактеристик</types>
    <types>CatalogRef.ЛабораторныеТесты</types>
    <types>Number</types>
    <types>CatalogRef.МедицинскоеОборудование</types>
    <types>CatalogRef.ВидыМедицинскихДокументов</types>
    <types>CatalogRef.КлассификаторыМинЗдрава</types>
    <types>CatalogRef.ХранилищеДополнительнойИнформации</types>
    <numberQualifiers>
      <precision>18</precision>
      <scale>4</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>1024</length>
    </stringQualifiers>
  </type>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ПрофпатологДополнениеКЗаключению</name>
      <description>Профпатолог: Дополнение к заключению</description>
      <code>000000005</code>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>ПрофпатологЗаключение</name>
      <description>Профпатолог: Заключение</description>
      <code>000000001</code>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>ПрофпатологИнфекционныйАнамнез</name>
      <description>Профпатолог: Инфекционный анамнез</description>
      <code>000000004</code>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>ПрофпатологРекомендации</name>
      <description>Профпатолог: Рекомендации</description>
      <code>000000002</code>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>ПрофпатологСведенияОПрививках</name>
      <description>Профпатолог: Сведения о прививках</description>
      <code>000000003</code>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>ЗначениеПоУмолчанию</name>
    <type>
      <types>CatalogRef.СправочникМеждународныхНепатентованныхНаименований</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ВычисляемыеЗначенияПараметров</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.РеестрМедицинскихОрганизаций</types>
      <types>CatalogRef.ИнструментальныеИсследования</types>
      <types>CatalogRef.НоменклатураМедицинскихУслуг</types>
      <types>Boolean</types>
      <types>CatalogRef.СоглашенияСтрахования</types>
      <types>CatalogRef.Клиенты</types>
      <types>CatalogRef.Филиалы</types>
      <types>CatalogRef.СтраховыеПолисы</types>
      <types>String</types>
      <types>CatalogRef.Диагнозы</types>
      <types>CatalogRef.Сотрудники</types>
      <types>Date</types>
      <types>CatalogRef.КатегорииВыработки</types>
      <types>CatalogRef.ДополнительныеЗначенияХарактеристик</types>
      <types>CatalogRef.ЛабораторныеТесты</types>
      <types>Number</types>
      <types>CatalogRef.МедицинскоеОборудование</types>
      <types>CatalogRef.ВидыМедицинскихДокументов</types>
      <types>CatalogRef.КлассификаторыМинЗдрава</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>4</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяВычисляемоеЗначение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеЗаполняетсяПредыдущимиЗначениями</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноДляЗаполнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяПрофпатологом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеРедактируетсяПользователем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматнаяСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПерсональныеДанные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыборПоСсылкеИзОграниченногоСписка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьВводВручнуюПриВыбореИзОграниченногоСписка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКлассификатора</name>
    <type>
      <types>EnumRef.ВидыКлассификаторовМинЗдрава</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнятьГотовымиФразамиВыборИзОграниченногоСписка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>EnumRef.КодировкаПолейЭМД</types>
      <types>CatalogRef.КлассификаторыМинЗдрава</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПакетыСоставныхФраз</name>
    <attributes>
      <name>Пакет</name>
      <type>
        <types>CatalogRef.ПакетыСоставныхФраз</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗначенияВыбора</name>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючРодителя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоГруппа</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>CatalogRef.ИнструментальныеИсследования</types>
        <types>String</types>
        <types>Number</types>
        <types>CatalogRef.КлассификаторыМинЗдрава</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>4</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

БИТУправление_медицинским_центром_демо/src/Catalogs/СоставныеФразы/СоставныеФразы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СоставныеФразы</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Параметр</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ПараметрыHTML</types>
      <types>CatalogRef.ПакетыСоставныхФраз</types>
    </type>
  </attributes>
  <attributes>
    <name>ДляВсехПользователей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/ChartsOfCharacteristicTypes/ПараметрыHTML/Forms/КопированиеФразИзДругогоПараметра/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заполнение дерева выбора по фразам параметра-донора.
	Объект = Параметры.Объект;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СоставныеФразы.Ссылка КАК Фраза,
	               |	ИСТИНА КАК Выбрано
	               |ИЗ
	               |	Справочник.СоставныеФразы КАК СоставныеФразы
	               |ГДЕ
	               |	СоставныеФразы.Параметр = &Параметр
	               |ИТОГИ
	               |	МАКСИМУМ(Выбрано)
	               |ПО
	               |	Фраза ТОЛЬКО ИЕРАРХИЯ";
	Запрос.УстановитьПараметр("Параметр", Параметры.Донор);
	ФразыОбъекта = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	СкорректироватьВыборкуВложенныеРодители(ФразыОбъекта);
	
	СкорректироватьВыборкуПустыеВетви(ФразыОбъекта);
	
	ЗначениеВРеквизитФормы(ФразыОбъекта, "Фразы");
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Скопировать(Команда)
	
	СкопироватьНаСервере();
	ЭтаФорма.Закрыть(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	
	Дерево = Фразы.ПолучитьЭлементы();
	ИзменитьОтметкиВДереве(Дерево, Истина);
	
КонецПроцедуры
	
&НаКлиенте
Процедура СнятьВсе(Команда)
	
	Дерево = Фразы.ПолучитьЭлементы();
	ИзменитьОтметкиВДереве(Дерево, Ложь);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийДереваФормы

&НаКлиенте
Процедура ФразыВыбраноПриИзменении(Элемент)
	
	ИзменитьОтметкиВДереве(Элементы.Фразы.ТекущиеДанные.ПолучитьЭлементы(), Элементы.Фразы.ТекущиеДанные.Выбрано);
	Если Элементы.Фразы.ТекущиеДанные.Выбрано = Истина Тогда 
		Родитель = Элементы.Фразы.ТекущиеДанные.ПолучитьРодителя();
		Пока Не Родитель = Неопределено Цикл
			Родитель.Выбрано = Истина;
			Родитель = Родитель.ПолучитьРодителя();
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ДействияПриСозданииНаСервере

&НаСервере
Процедура СкорректироватьВыборкуВложенныеРодители(Дерево)
	
	Для Каждого Строка Из Дерево.Строки Цикл
		Если ЗначениеЗаполнено(Строка.Родитель) Тогда
			Если Строка.Родитель.Фраза = Строка.Фраза Тогда
				Дерево.Строки.Удалить(Строка);
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		Если Строка.Строки.Количество() > 0 Тогда
			СкорректироватьВыборкуВложенныеРодители(Строка);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СкорректироватьВыборкуПустыеВетви(Дерево)
	
	Для Каждого Строка Из Дерево.Строки Цикл
		Если Не ЗначениеЗаполнено(Строка.Фраза) Тогда
			Для Каждого СтрокаИзПустойСтроки Из Строка.Строки Цикл
				НоваяСтрока = Дерево.Строки.Добавить();
				НоваяСтрока.Фраза = СтрокаИзПустойСтроки.Фраза;
				НоваяСтрока.Выбрано = СтрокаИзПустойСтроки.Выбрано;
			КонецЦикла;
			Дерево.Строки.Удалить(Строка);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ИзменитьОтметкиВДереве(УровеньДерева, Выбрано)
	
	Для Каждого Строка Из УровеньДерева Цикл
		Строка.Выбрано = Выбрано;
		Если Строка.ПолучитьЭлементы().Количество() > 0 Тогда
			ИзменитьОтметкиВДереве(Строка.ПолучитьЭлементы(), Выбрано);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#Область КопированиеФраз

&НаСервере
Процедура СкопироватьНаСервере()
	
	Дерево = Фразы.ПолучитьЭлементы();
	СкопироватьУровеньДерева(Дерево);
	
КонецПроцедуры

&НаСервере
Процедура СкопироватьУровеньДерева(Дерево, Родитель = Неопределено)
	
	Для Каждого Строка Из Дерево Цикл
		Если Строка.Выбрано = Истина Тогда
			НоваяФраза = СоздатьФразу(Строка.Фраза, Родитель);
			Ветка = Строка.ПолучитьЭлементы();
			Если Ветка.Количество() > 0 Тогда
				СкопироватьУровеньДерева(Ветка, НоваяФраза);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
			
КонецПроцедуры

&НаСервере
Функция СоздатьФразу(Фраза, Родитель)
	
	СпрСоставныеФразы = Справочники.СоставныеФразы;
	НоваяФраза = СпрСоставныеФразы.СоздатьЭлемент();
	НоваяФраза.Текст = Фраза.Текст;
	НоваяФраза.Наименование = Фраза.Наименование;
	НоваяФраза.Параметр = Объект;
	Если Не Родитель = Неопределено Тогда
		НоваяФраза.Родитель = Родитель.Ссылка;	
	КонецЕсли;
	НоваяФраза.Записать();
	Возврат НоваяФраза;
	
КонецФункции

#КонецОбласти

#КонецОбласти
